In [1]:
import pandas as pd

In [ ]:
#[[1,2,3],[4,5,6],[7,8,9],[10,11,12]]

# Convert DataFrame

In [ ]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

# define column name

In [9]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["c1","c2","c3"]) 
print(df)

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

# define index name

In [12]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["c1","c2","c3"], index=["r1","r2","r3","r4"]) 
print(df)

    c1  c2  c3
r1   1   2   3
r2   4   5   6
r3   7   8   9
r4  10  11  12

# first 4-5 row show :

In [13]:
df.head()

    c1  c2  c3
r1   1   2   3
r2   4   5   6
r3   7   8   9
r4  10  11  12

In [14]:
df.head(2)

    c1  c2  c3
r1   1   2   3
r2   4   5   6

# last 4-5 row show :

In [15]:
df.tail()

    c1  c2  c3
r1   1   2   3
r2   4   5   6
r3   7   8   9
r4  10  11  12

In [16]:
df.tail(2)

    c1  c2  c3
r3   7   8   9
r4  10  11  12

# column count

In [18]:
df.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [ ]:
df.columns.to_list() #as a list

['c1', 'c2', 'c3']